RT-Thread-Studio/sdk-csp-gd32h7/libraries/GD32H75E_standard_peripheral/Include/gd32h75e_can.h
#define MDES1_PRIO(regval)                   (BITS(29,31) & ((uint32_t)(regval) << 29U))  /*!< write value to MDES1 descriptor PRIO bit field */

/* FDES1 descriptor */
#define GET_FDES1_ID_EXD(regval)             GET_BITS((regval),0,28)                      /*!< get FDES1 descriptor ID_STD and ID_EXD bit field */
#define FDES1_ID_EXD(regval)                 (BITS(0,28) & ((uint32_t)(regval) << 0U))    /*!< write value to FDES1 descriptor ID_STD and ID_EXD bit field */

#define GET_FDES1_ID_STD(regval)             GET_BITS((regval),18,28)                     /*!< get FDES1 descriptor ID_STD bit field */
#define FDES1_ID_STD(regval)                 (BITS(18,28) & ((uint32_t)(regval) << 18U))  /*!< write value to FDES1 descriptor ID_STD bit field */

/* FDESx descriptor */
#define CAN_DATA_FRAME_ACCEPTED              ((uint32_t)0x00000000U)                      /*!< remote frames are rejected and data frames can be stored */
#define CAN_REMOTE_FRAME_ACCEPTED            ((uint32_t)0x00000001U)                      /*!< remote frames can be stored and data frames are rejected */

#define CAN_STANDARD_FRAME_ACCEPTED          ((uint32_t)0x00000000U)                      /*!< extended frames are rejected and standard frames can be stored */
#define CAN_EXTENDED_FRAME_ACCEPTED          ((uint32_t)0x00000001U)                      /*!< extended frames can be stored and standard frames are rejected */

#define FIFO_FILTER_ID_EXD_A(val)            (((uint32_t)(val) << 0U) & CAN_FDESX_ID_EXD_A) /*!< valid extended ID filter field in format A */
#define FIFO_FILTER_ID_STD_A(val)            (((uint32_t)(val) << 18U) & CAN_FDESX_ID_STD_A)/*!< valid standard ID filter field in format A */
#define FIFO_FILTER_ID_EXD_B0(val)           (GET_BITS((val),15,28) << 16U)                 /*!< valid extended ID filter field in format B */
#define FIFO_FILTER_ID_EXD_B1(val)           (GET_BITS((val),15,28) << 0U)                  /*!< valid extended ID filter field in format B */
#define FIFO_FILTER_ID_STD_B0(val)           (GET_BITS((val),0,10) << 19U)                  /*!< valid standard ID filter field in format B */
#define FIFO_FILTER_ID_STD_B1(val)           (GET_BITS((val),0,10) << 3U)                   /*!< valid standard ID filter field in format B */
#define FIFO_FILTER_ID_EXD_C0(val)           (GET_BITS((val),21,28) << 24U)                 /*!< valid extended ID filter field in format C */
#define FIFO_FILTER_ID_EXD_C1(val)           (GET_BITS((val),21,28) << 16U)                 /*!< valid extended ID filter field in format C */
#define FIFO_FILTER_ID_EXD_C2(val)           (GET_BITS((val),21,28) << 8U)                  /*!< valid extended ID filter field in format C */
#define FIFO_FILTER_ID_EXD_C3(val)           (GET_BITS((val),21,28) << 0U)                  /*!< valid extended ID filter field in format C */
#define FIFO_FILTER_ID_STD_C0(val)           (GET_BITS((val),3,10) << 24U)                  /*!< valid standard ID filter field in format C */
#define FIFO_FILTER_ID_STD_C1(val)           (GET_BITS((val),3,10) << 16U)                  /*!< valid standard ID filter field in format C */
#define FIFO_FILTER_ID_STD_C2(val)           (GET_BITS((val),3,10) << 8U)                   /*!< valid standard ID filter field in format C */
#define FIFO_FILTER_ID_STD_C3(val)           (GET_BITS((val),3,10) << 0U)                   /*!< valid standard ID filter field in format C */

/* timeout definitions */
#define CAN_DELAY                           ((uint32_t)0x01FFFFFFU)                         /*!< state timeout */
#define CAN_MAX_MAILBOX_NUM                  32U                                            /*!< the supported maximum mailbox number */
#define CAN_MAX_RAM_SIZE                    (CAN_MAX_MAILBOX_NUM * 4U)                      /*!< the maximum RAM size used for CAN mailbox */
#define CAN_STANDARD                         BIT(31)                                        /*!< standard frames */
#define CAN_EXTENDED                         ((uint32_t)0x00000000U)                        /*!< extended frames*/

/* parameter check definitions */
#ifdef FW_DEBUG_ERR_REPORT

#define NOT_CAN_PERIPH(can_periph)            (((can_periph)!= CAN0) && ((can_periph)!= CAN1) && ((can_periph)!= CAN2))

#define NOT_CAN_CONTROL_STATUS(param)         (((param)!= (uint32_t)ENABLE) && ((param)!= (uint32_t)DISABLE))

#define NOT_CAN_TIMER_SOURCE(param)           (((param)!= CAN_TIMER_SOURCE_BIT_CLOCK) && ((param)!= CAN_TIMER_SOURCE_EXTERNAL_TIME_TICK))

#define NOT_CAN_RRFRMS(param)                 (((param)!= CAN_GEN_REMOTE_RESPONSE_FRAME)  && ((param)!= CAN_STORE_REMOTE_REQUEST_FRAME))

#define NOT_CAN_IDERTR_RMF(param)             (((param)!= CAN_IDE_RTR_COMPARED) && ((param)!= CAN_IDE_RTR_FILTERED))

#define NOT_CAN_MB_TX_ORDER(param)            (((param)!= CAN_TX_HIGH_PRIORITY_MB_FIRST) && ((param)!= CAN_TX_LOW_NUM_MB_FIRST))

#define NOT_CAN_MEMORY_SIZE(param)            (((param)!= CAN_MEMSIZE_1_UNIT) && ((param)!= CAN_MEMSIZE_2_UNIT) && \
                                              ((param)!= CAN_MEMSIZE_3_UNIT)  && ((param)!= CAN_MEMSIZE_4_UNIT) && \
                                              ((param)!= CAN_MEMSIZE_5_UNIT)  && ((param)!= CAN_MEMSIZE_6_UNIT) && \
                                              ((param)!= CAN_MEMSIZE_7_UNIT)  && ((param)!= CAN_MEMSIZE_8_UNIT) && \
                                              ((param)!= CAN_MEMSIZE_9_UNIT)  && ((param)!= CAN_MEMSIZE_10_UNIT) && \
                                              ((param)!= CAN_MEMSIZE_11_UNIT) && ((param)!= CAN_MEMSIZE_12_UNIT) && \
                                              ((param)!= CAN_MEMSIZE_13_UNIT) && ((param)!= CAN_MEMSIZE_14_UNIT) && \
                                              ((param)!= CAN_MEMSIZE_15_UNIT) && ((param)!= CAN_MEMSIZE_16_UNIT) && \
                                              ((param)!= CAN_MEMSIZE_17_UNIT) && ((param)!= CAN_MEMSIZE_18_UNIT) && \
                                              ((param)!= CAN_MEMSIZE_19_UNIT) && ((param)!= CAN_MEMSIZE_20_UNIT) && \
                                              ((param)!= CAN_MEMSIZE_21_UNIT) && ((param)!= CAN_MEMSIZE_22_UNIT) && \
                                              ((param)!= CAN_MEMSIZE_23_UNIT) && ((param)!= CAN_MEMSIZE_24_UNIT) && \
                                              ((param)!= CAN_MEMSIZE_25_UNIT) && ((param)!= CAN_MEMSIZE_26_UNIT) && \
                                              ((param)!= CAN_MEMSIZE_27_UNIT) && ((param)!= CAN_MEMSIZE_28_UNIT) && \
                                              ((param)!= CAN_MEMSIZE_29_UNIT) && ((param)!= CAN_MEMSIZE_30_UNIT) && \
                                              ((param)!= CAN_MEMSIZE_31_UNIT) && ((param)!= CAN_MEMSIZE_32_UNIT))

#define NOT_CAN_PRESCALER(param)              (((param) < 1U) || ((param) > 1024U))

