RT-Thread-Studio/sdk-csp-gd32h7/libraries/GD32H75E_standard_peripheral/Include/gd32h75e_can.h
#define NOT_CAN_PROP_TIME_SEGMENT(param)      (((param) < 1U) || ((param) > 64U))

#define NOT_CAN_RESYNC_JUMP_WIDTH(param)      (((param) < 1U) || ((param) > 32U))

#define NOT_CAN_TIME_SEGMENT_1(param)         (((param) < 1U) || ((param) > 32U))

#define NOT_CAN_TIME_SEGMENT_2(param)         (((param) < 1U) || ((param) > 32U))

#define NOT_CAN_RX_FILTER_ORDER(param)        (((param)!= CAN_RX_FILTER_ORDER_FIFO_FIRST) && ((param)!= CAN_RX_FILTER_ORDER_MAILBOX_FIRST))

#define NOT_CAN_MAILBOX_INDEX(param)          ((param) > 31U)

#define NOT_CAN_PN_MB_INDEX(param)            ((param) > 3U)

#define NOT_CAN_MAILBOX_DATA_SIZE(param)      (((param)!= CAN_MAILBOX_DATA_SIZE_8_BYTES) && ((param)!= CAN_MAILBOX_DATA_SIZE_16_BYTES) && \
                                              ((param)!= CAN_MAILBOX_DATA_SIZE_32_BYTES) && ((param)!= CAN_MAILBOX_DATA_SIZE_64_BYTES))

#define NOT_CAN_FD_PRESCALER(param)           (((param) < 1U) || ((param) > 1024U))

#define NOT_CAN_FD_PROP_TIME_SEGMENT(param)   (((param) < 1U) || ((param) > 31U) )

#define NOT_CAN_FD_RESYNC_JUMP_WIDTH(param)   (((param) < 1U) || ((param) > 8U) )

#define NOT_CAN_FD_TDC_OFFSET(param)          ((param) > 31U)

#define NOT_CAN_FD_TIME_SEGMENT_1(param)      (((param) < 1U) || ((param) > 8U) )

#define NOT_CAN_FD_TIME_SEGMENT_2(param)      (((param) < 2U) || ((param) > 8U) )

#define NOT_CAN_RXFIFO_FILTER_FN(param)       (((param)!= CAN_RXFIFO_FILTER_A_NUM_8)  && ((param)!= CAN_RXFIFO_FILTER_A_NUM_16) && \
                                              ((param)!= CAN_RXFIFO_FILTER_A_NUM_24)  && ((param)!= CAN_RXFIFO_FILTER_A_NUM_32) && \
                                              ((param)!= CAN_RXFIFO_FILTER_A_NUM_40)  && ((param)!= CAN_RXFIFO_FILTER_A_NUM_48) && \
                                              ((param)!= CAN_RXFIFO_FILTER_A_NUM_56)  && ((param)!= CAN_RXFIFO_FILTER_A_NUM_64) && \
                                              ((param)!= CAN_RXFIFO_FILTER_A_NUM_72)  && ((param)!= CAN_RXFIFO_FILTER_A_NUM_80) && \
                                              ((param)!= CAN_RXFIFO_FILTER_A_NUM_88)  && ((param)!= CAN_RXFIFO_FILTER_A_NUM_96) && \
                                              ((param)!= CAN_RXFIFO_FILTER_A_NUM_104) && ((param)!= CAN_RXFIFO_FILTER_B_NUM_16) && \
                                              ((param)!= CAN_RXFIFO_FILTER_B_NUM_32)  && ((param)!= CAN_RXFIFO_FILTER_B_NUM_48) && \
                                              ((param)!= CAN_RXFIFO_FILTER_B_NUM_64)  && ((param)!= CAN_RXFIFO_FILTER_B_NUM_80) && \
                                              ((param)!= CAN_RXFIFO_FILTER_B_NUM_96)  && ((param)!= CAN_RXFIFO_FILTER_B_NUM_112) && \
                                              ((param)!= CAN_RXFIFO_FILTER_B_NUM_128) && ((param)!= CAN_RXFIFO_FILTER_B_NUM_144) && \
                                              ((param)!= CAN_RXFIFO_FILTER_B_NUM_160) && ((param)!= CAN_RXFIFO_FILTER_B_NUM_176) && \
                                              ((param)!= CAN_RXFIFO_FILTER_B_NUM_192) && ((param)!= CAN_RXFIFO_FILTER_B_NUM_208) && \
                                              ((param)!= CAN_RXFIFO_FILTER_C_NUM_32)  && ((param)!= CAN_RXFIFO_FILTER_C_NUM_64) && \
                                              ((param)!= CAN_RXFIFO_FILTER_C_NUM_96)  && ((param)!= CAN_RXFIFO_FILTER_C_NUM_128) && \
                                              ((param)!= CAN_RXFIFO_FILTER_C_NUM_160) && ((param)!= CAN_RXFIFO_FILTER_C_NUM_192) && \
                                              ((param)!= CAN_RXFIFO_FILTER_C_NUM_224) && ((param)!= CAN_RXFIFO_FILTER_C_NUM_256) && \
                                              ((param)!= CAN_RXFIFO_FILTER_C_NUM_288) && ((param)!= CAN_RXFIFO_FILTER_C_NUM_320) && \
                                              ((param)!= CAN_RXFIFO_FILTER_C_NUM_352) && ((param)!= CAN_RXFIFO_FILTER_C_NUM_384) && \
                                              ((param)!= CAN_RXFIFO_FILTER_C_NUM_416) && ((param)!= CAN_RXFIFO_FILTER_D))

#define NOT_CAN_EXTENDED_FRAME(param)         (((param)!= CAN_STANDARD_FRAME_ACCEPTED) && ((param)!= CAN_EXTENDED_FRAME_ACCEPTED))

#define NOT_CAN_ID(type, param)               ((((param) > 0x7FFU)&&((type) == CAN_STANDARD_FRAME_ACCEPTED)) || \
                                              (((param) > 0x1FFFFFFFU)&&((type) == CAN_EXTENDED_FRAME_ACCEPTED)))

#define NOT_CAN_REMOTE_FRAME(param)           (((param)!= CAN_DATA_FRAME_ACCEPTED) && ((param)!= CAN_REMOTE_FRAME_ACCEPTED))

#define NOT_CAN_1_BIT_VALUE(param)            ((param) > 1U)

#define NOT_CAN_3_BIT_VALUE(param)            ((param) > 7U)

#define NOT_CAN_MDES0_CODE(param)             (((param)!= CAN_MB_RX_STATUS_INACTIVE) && ((param)!= CAN_MB_RX_STATUS_FULL) && \
                                              ((param)!= CAN_MB_RX_STATUS_EMPTY)     && ((param)!= CAN_MB_RX_STATUS_OVERRUN) && \
                                              ((param)!= CAN_MB_RX_STATUS_RANSWER)   && ((param)!= CAN_MB_RX_STATUS_BUSY) && \
                                              ((param)!= CAN_MB_TX_STATUS_INACTIVE)  && ((param)!= CAN_MB_TX_STATUS_ABORT) && \
                                              ((param)!= CAN_MB_TX_STATUS_DATA))

#define NOT_CAN_DATA_BYTES(param)             ((param) > 64U)

#define NOT_CAN_PN_DATA_FILTER(param)         (((param)!= CAN_PN_DATA_FILTERING_EXACT)   && ((param)!= CAN_PN_DATA_FILTERING_GREATER) && \
                                              ((param)!= CAN_PN_DATA_FILTERING_SMALLER)  && ((param)!= CAN_PN_DATA_FILTERING_RANGE))

#define NOT_CAN_PN_FRAME_FILTER(param)        (((param)!= CAN_PN_FRAME_FILTERING_ID)     && ((param)!= CAN_PN_FRAME_FILTERING_ID_DATA) && \
                                              ((param)!= CAN_PN_FRAME_FILTERING_ID_NMM)  && ((param)!= CAN_PN_FRAME_FILTERING_ID_DATA_NMM))

#define NOT_CAN_PN_ID_FILTER(param)           (((param)!= CAN_PN_ID_FILTERING_EXACT)     && ((param)!= CAN_PN_ID_FILTERING_GREATER) && \
                                              ((param)!= CAN_PN_ID_FILTERING_SMALLER)    && ((param)!= CAN_PN_ID_FILTERING_RANGE))

#define NOT_CAN_PN_MATCH_TIMEOUT(param)       ((param) > 0xFFFFU)

